Spoilers.org
#+title: Spoilers
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="index.css" />
#+OPTIONS: num:nil

Hebbo!

Here be spoilers.

 Outline

Everything is subject to change, eebureetang. But you'll have to retitle if we don't have a smackdown involving Gog's use of the word "boulder-stump" somehow.

** Ch. 000 Preface

We meet the Crec and learn about their world. Verk tells a story. It is deeply meaningful for some.

** Ch. 001, wherein we learn of Zog's great acumen and fertility

We take the reader back to Zog's early years. Zog current clan leader, and that's why it's called "The Zog clan". Zog was a hero's hero, in other words, lucky he's not dead. He was known for his daring and just kind of /falling into/ situations that make him have the appearance of a total badass. He just happens to be the guy in the good -vs evil movie that throws the rock that seriously wounds the bad guy in the satisfying end. Roll credits. But despite all of his impressive doings, he really only has so much of a clue what's going on. He's not learned to have a look of wonderment when things work out for him. Giving the impression that he meant to do that all along is central to his persona. This means giving some pretty weak and convoluted explanations. We hear the perplexing story of Zog's first dive, and as far as anyone knew, first dive ever in the tar pits. He came off looking like a total stud, but came within seconds of dying about eight different times in the process.

Let's have a from-birth to marriage fast-forward, followed by tales of daring from his youth. And of course, displaying, entirely for what it is, his deeply held, more or less random believes that he's willing to club-fight over. Lots of adventures. Lots of badassery.

The lesson? There is a right way to be a Crec. Zog simply exemplifies it.

** Ch. 001, wh


** Ch. 00~, wherein Grav starts studying to become a lawyer (though we have a clever name for it)
...
Note: Grav cleverly invents the concept of "lawyer", works hard to become one, folks realize that not just anyone should be allowed to be a lawyer as you can ruin people's lives (!) and so creates Official Criteria, which Grav cannot meet. Grav becomes the first lawyer to exist and then the first law school student to fail the Bar (what funny word instead of "bar"? "stick"?) exam.
...
** Ch. 00~, wherein Gog scratches "boulder-stump" into a soot-pallet and shouts it from atop Lame-Monkey Mountain three times on a dare
...
** Ch. 00~, wherein the Make-Stop-Banana-Word Commission of the Elders-Quarum begins proceedings to update the list
...
** Ch. 00~, wherein Zog distracts from the business of the Elders-Quarum with an incident involving a hyena
...


* Bugs

- Verk's joke on Lu makes no sense with the level of sophistication they have. Even if you say "well, after the club wars they had a big Renaissance thing", the hide they share with Oh-Mas is clearly sophisticated, but also way before Crec times BUT the Momma Bear Palace (or whatever) is obviously wicked grand, and yet they did not know to /tie a rope to a boulder and yank it out of the way/?
- It seems like Grav "retires to his burrow" a few too many times, probably creating an inconsistency.
- Thag gives a big speech, but he has no lower lip!? Maybe he has a speaker. Maybe we lose track of who is the main attraction: the speaker or the deformed, dumb man? (oooh)
- It seems like we claim G&G and all cavemen always run in the woods (first, maybe drop that?) but sometimes they are walking!!? Actual bushmen (whatever) do not do this unless they're running down a prey. Maybe instead, the men are in a hurry to get to the mine for some /reason/...? Then they may freely walk on occasion, released from the author's unreasonable expectations.
- wrt running to the mine, maybe you issekinichou: you explain /why/ they are going (which we don't) and that is an "mild emergency" of some kind and so that is also why they are /running/.
- Lots of references to forest-children. It needs to be presented in-order.
- How do we not duplicate definitions: one definition is in a footnote, the other is in the "Glossary"?

* Relations

- Grut[fn:: The Great.], haver of potent seed, starter of epochs. "Son Of..?", you ask? Well we don't know the answer to that, do we. His time is as far back as memory goes. He and his only wife Jaar are the founders of what is /now/ called the Zog clan.
- Would like too mechanize this and make a pretty diagram, maybe a python script.

