Spoilers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-10 Fri 10:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Michael Burr" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfedad4b">1. Outline</a>
<ul>
<li><a href="#org911bf73">1.1. Ch. 000 Preface</a></li>
<li><a href="#org5b5fa51">1.2. Ch. 001, wherein we learn of Zog's great acumen and fertility</a></li>
<li><a href="#orgd8ddddc">1.3. Ch. 001, wh</a></li>
<li><a href="#orga8c9c71">1.4. Ch. 00~, wherein Grav starts studying to become a lawyer (though we have a clever name for it)</a></li>
<li><a href="#org5ee3218">1.5. Ch. 00~, wherein Gog scratches "boulder-stump" into a soot-pallet and shouts it from atop Lame-Monkey Mountain three times on a dare</a></li>
<li><a href="#org094a9bf">1.6. Ch. 00~, wherein the Make-Stop-Banana-Word Commission of the Elders-Quarum begins proceedings to update the list</a></li>
<li><a href="#org9b144a1">1.7. Ch. 00~, wherein Zog distracts from the business of the Elders-Quarum with an incident involving a hyena</a></li>
</ul>
</li>
<li><a href="#orgd0300b7">2. Bugs</a></li>
<li><a href="#org5000eb4">3. Relations</a></li>
<li><a href="#org8f4064b">4. Notes</a></li>
<li><a href="#org7e5d7ab">5. Ephemeral Notes</a></li>
</ul>
</div>
</div>
<p>
Hebbo!
</p>

<p>
Here be spoilers.
</p>

<div id="outline-container-orgfedad4b" class="outline-2">
<h2 id="orgfedad4b"><span class="section-number-2">1</span> Outline</h2>
<div class="outline-text-2" id="text-1">
<p>
Everything is subject to change, eebureetang. But you'll have to retitle if we don't have a smackdown involving Gog's use of the word "boulder-stump" somehow.
</p>
</div>

<div id="outline-container-org911bf73" class="outline-3">
<h3 id="org911bf73"><span class="section-number-3">1.1</span> Ch. 000 Preface</h3>
<div class="outline-text-3" id="text-1-1">
<p>
We meet the Crec and learn about their world. Verk tells a story. It is deeply meaningful for some.
</p>
</div>
</div>

<div id="outline-container-org5b5fa51" class="outline-3">
<h3 id="org5b5fa51"><span class="section-number-3">1.2</span> Ch. 001, wherein we learn of Zog's great acumen and fertility</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We take the reader back to Zog's early years. Zog current clan leader, and that's why it's called "The Zog clan". Zog was a hero's hero, in other words, lucky he's not dead. He was known for his daring and just kind of <i>falling into</i> situations that make him have the appearance of a total badass. He just happens to be the guy in the good -vs evil movie that throws the rock that seriously wounds the bad guy in the satisfying end. Roll credits. But despite all of his impressive doings, he really only has so much of a clue what's going on. He's not learned to have a look of wonderment when things work out for him. Giving the impression that he meant to do that all along is central to his persona. This means giving some pretty weak and convoluted explanations. We hear the perplexing story of Zog's first dive, and as far as anyone knew, first dive ever in the tar pits. He came off looking like a total stud, but came within seconds of dying about eight different times in the process.
</p>

<p>
Let's have a from-birth to marriage fast-forward, followed by tales of daring from his youth. And of course, displaying, entirely for what it is, his deeply held, more or less random believes that he's willing to club-fight over. Lots of adventures. Lots of badassery.
</p>

<p>
The lesson? There is a right way to be a Crec. Zog simply exemplifies it.
</p>
</div>
</div>

<div id="outline-container-orgd8ddddc" class="outline-3">
<h3 id="orgd8ddddc"><span class="section-number-3">1.3</span> Ch. 001, wh</h3>
</div>


<div id="outline-container-orga8c9c71" class="outline-3">
<h3 id="orga8c9c71"><span class="section-number-3">1.4</span> Ch. 00~, wherein Grav starts studying to become a lawyer (though we have a clever name for it)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
&#x2026;
Note: Grav cleverly invents the concept of "lawyer", works hard to become one, folks realize that not just anyone should be allowed to be a lawyer as you can ruin people's lives (!) and so creates Official Criteria, which Grav cannot meet. Grav becomes the first lawyer to exist and then the first law school student to fail the Bar (what funny word instead of "bar"? "stick"?) exam.
&#x2026;
</p>
</div>
</div>
<div id="outline-container-org5ee3218" class="outline-3">
<h3 id="org5ee3218"><span class="section-number-3">1.5</span> Ch. 00~, wherein Gog scratches "boulder-stump" into a soot-pallet and shouts it from atop Lame-Monkey Mountain three times on a dare</h3>
<div class="outline-text-3" id="text-1-5">
<p>
&#x2026;
</p>
</div>
</div>
<div id="outline-container-org094a9bf" class="outline-3">
<h3 id="org094a9bf"><span class="section-number-3">1.6</span> Ch. 00~, wherein the Make-Stop-Banana-Word Commission of the Elders-Quarum begins proceedings to update the list</h3>
<div class="outline-text-3" id="text-1-6">
<p>
&#x2026;
</p>
</div>
</div>
<div id="outline-container-org9b144a1" class="outline-3">
<h3 id="org9b144a1"><span class="section-number-3">1.7</span> Ch. 00~, wherein Zog distracts from the business of the Elders-Quarum with an incident involving a hyena</h3>
<div class="outline-text-3" id="text-1-7">
<p>
&#x2026;
</p>
</div>
</div>
</div>


<div id="outline-container-orgd0300b7" class="outline-2">
<h2 id="orgd0300b7"><span class="section-number-2">2</span> Bugs</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>It seems like Grav "retires to his burrow" a few too many times, probably creating an inconsistency.</li>
<li>Thag gives a big speech, but he has no lower lip!? Maybe he has a speaker. Maybe we lose track of who is the main attraction: the speaker or the deformed, dumb man? (oooh)</li>
<li>It seems like we claim G&amp;G and all cavemen always run in the woods (first, maybe drop that?) but sometimes they are walking!!? Actual bushmen (whatever) do not do this unless they're running down a prey. Maybe instead, the men are in a hurry to get to the mine for some <i>reason</i>&#x2026;? Then they may freely walk on occasion, released from the author's unreasonable expectations.</li>
<li>wrt running to the mine, maybe you issekinichou: you explain <i>why</i> they are going (which we don't) and that is an "mild emergency" of some kind and so that is also why they are <i>running</i>.</li>
<li>Lots of references to forest-children. It needs to be presented in-order.</li>
<li>How do we not duplicate definitions: one definition is in a footnote, the other is in the "Glossary"?</li>
</ul>
</div>
</div>

<div id="outline-container-org5000eb4" class="outline-2">
<h2 id="org5000eb4"><span class="section-number-2">3</span> Relations</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Grut<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>, haver of potent seed, starter of epochs. "Son Of..?", you ask? Well we don't know the answer to that, do we. His time is as far back as memory goes. He and his only wife Jaar are the founders of what is <i>now</i> called the Zog clan.</li>
<li>Would like too mechanize this and make a pretty diagram, maybe a python script.</li>
</ul>
</div>
</div>
