Spoilers.html

<div id="outline-container-org8f4064b" class="outline-2">
<h2 id="org8f4064b"><span class="section-number-2">4</span> Notes</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>If we need a girlfriend episode: We know that one just ignores women on selection-journey, but a character <i>could</i> choose to break protocol, fall in love, and escape into the anonymous jungle with your new bride-prize to start a new life. aww.</li>
<li>Seems like if G&amp;G are going <i>to</i> the camp from BZ, it would be reasonable to assume that Verk came <i>from</i> that direction in Ch01. So, do G&amp;G not go through monkey pass?</li>
<li>Snogny-Dodk copy protection:
<ul class="org-ul">
<li>Some scheme has a laughable workaround</li>
<li>He works on getting "the authorities" to prevent "theft"</li>
</ul></li>
<li>G&amp;G realize that any kind of "penalty" for anything has to be anchored by another "penalty". The first three steps might be a "fine", the fourth "torture", the fifth, "death"&#x2026; but all must be anchored with death. Force is inevitable. something!! &lt;-xxx</li>
<li>A ridiculously huge flag could fly atop Bhorv Zolk (on occasion, for reason)</li>
<li>There are a couple of colourfoul characters that could exist:
<ul class="org-ul">
<li>"hi"</li>
</ul></li>
<li>Are there airquotes in Crec-world?</li>
<li>Naming surrounding the rock-stick-rocks:
<ul class="org-ul">
<li>The three pieces share a single name. There is no name for the rock-weener by itself or the halves.</li>
<li>It is known to all as Ender's-Sword.</li>
<li>G&amp;G call it Ender's-Stump but only amongst themselves.</li>
<li>G&amp;G have their own name, which they share with nobody. They got tired of making finger quotes.</li>
</ul></li>
<li>Notes about military:
<ul class="org-ul">
<li>We need a good name for the camp: "Choh-Ov is an xxx"</li>
<li>Towns around military bases are universally a disaster (as they are in Reality, along with University towns) The following name choices were made to make it easier to remember (For me! We should probably do some Okinawa bases.)
<ul class="org-ul">
<li>Fayt-Caves ==&gt; Fayetteville</li>
<li>Choh-Ov ==&gt; Fort Bragg (get it?)</li>
</ul></li>
</ul></li>
<li>We eventually find that you can say "BS" in place of "Boulder-Stump" and for some reason be totally OK (long explanation of translator's choices when terming it "BS".)</li>
<li>It would be awesome if when Verk kicks it, they find a great big tumor (heh. maybe he falls off a cliff and this grey turd comes oozing out of his skull amidst his brains. The Crec know, "this ain't right"). Knowing "this ain't right", they ponder the possibility that this might have been a/the <i>cause</i> for all the fun Verk features.</li>
<li>Self Marriage ceremony (no, this is not "gay"): The Crec have a Self-Marriage ceremony, where the caveboy-coming-of-age takes a bunch of wedding vows about loving himself no matter what. Nobody laughs, a few ol' gits cry. This among men is considered waaay more important than the other kinds of marriage. It is here where we revisit some of Grav's delightful encounters with Verk.</li>
<li>It turns out Zog is a really good dude. His son, Grav think's he's pretty awesome except for one quirk: He defends Brother Verk no matter what and is willfully blind to any amount of evidence.</li>
<li>Verk has a son named XXX (actually, that'd be a pretty good name). He is clearly dramatized by having Verk as a dad and just runs out the clock doing some (sometimes shockingly) cool stuff. Fiddles with this and that, stays out of Verk's way, is quietly an unobtrusive genius occasionally. Is deferential to the point of nausea. Don't want no trouble. Talks very little.</li>
<li>Someone speculates that the outer perimiter crack of the stick-stone/devil-fish-stone is so sharp because the outside had been polished by Nature. Otherwise it would be jagged. Reproducible of course.</li>
<li>Capitalization of Workers explained: they got together, decided to spring the union thing on G&amp;G, who were more than prepared. The workers would shout, "THE WORKERS!" at the end of every other utterance (but only when appearing as a group) and so after literally hours of negotiation, the compromised on having their so-called superiors refer to them as a group in the same way: No matter in what context, when refering to the workers, according to the bylaws of G&amp;G, had to make an effort to enthusiastically shout, e.g. "Hey, Guff, some of <i>THE WORKERS</i> are late this dawn. Do you know of any reason?" All were satisfied with the arrangement.</li>
<li>The reason they keep fucking up on standardizing certain measurements is that they literally have not yet thought of the possibility of these things varying. Crec were Crec.</li>
<li>At some point, the sluice encounters a low cliff on the riverbank. They find <i>booones</i>!</li>
<li>Mmaybe something so valuable is found that we have to start worrying about theft at the mine.</li>
<li>Some one gets trapped in the River-Fist. You just get pushed down there and twist and twist and twist along with a bunch of rocks. The only salvation is either to move the sluce (maybe it's wedged in place for some reason) or to install the "boar", which the Workers, in their panic, drop over the side, 8 men (or something) down below. Oh! Noes!</li>
<li>Numbers are wordy in order to put us in a frame of mind where abstract numbers are "novel", as they are to them.</li>
<li>Somebody notices that if you twist three fibers one way and wound them the <i>other</i> way, you'd have some twist-vine that is not bouncy and doesn't twist when it's not supposed to.</li>
<li>There needs to be Ernest. T. Bass/Leroy Jenkins character that is nice-junlge-term-for-crazy and injects harmless randomness all the time.</li>
<li>Now is your chance: invent an animal that, instead of giving birth, lets its babies gradually it it from the inside out, hunting for food until it becomes impossible, then drops dead and is eaten some more. Then something furry, adorable, and covered with rotted gore climbs out.</li>
<li>"Now, Gak, you've got a situation here with that boy of yours. He's mostly just runnin' around messin' with his stick and hanging out with girls. See, if he was an all-finger or more, that'd be good news for you, 'grandpa', but sometimes it's just unseemly. I saw him smelling a quiet-one's pile. Time was, you could drown a wretched runt like that in the river with a good hemp basket and a rock. The do-gooder Forest-Deer and there meddlin in family life put an end to that! But&#x2026;"</li>
<li>I like the expression "thou dost smite meeee!"<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> as a ritual kind of thing that's as unconscious as "Allahu Akbar" or "Bless You". But screamed at the sky during the hight of frustration, of course. Sometimes, as the "eeeeeeeee" is lengthened, the frustration goes vertical, as someone is high up a tree wrenching on a beehive. Usually, this last jerk of rage-derived power is enough to at least "unstick" the frustrating situation (You might imagine the beehive coming loose and the caveman falling 4 stories onto packed mud, the last 'eeee&#x2026;' trails off as he lays in his crater.)</li>
<li>The word "think-long" is the transliteration of the compound word of theirs tha means "rational" in pretty much the sense that we mean it. It is a slur because, while it has been observed that rational thought bears good results often, the overwhelming majority of data showed that, when your life depends on it, as it nearly always does, relying on the supernatural bears better results. Therefore, being think-long (rational) is to just waste time and look like a good, naive target for pouncing instead of learning and practicing The Art that would likely save your life one day. rational: insult.</li>
<li>The big reveal at the end: bad 'bad' guys and 'good' guys literally just go their separate ways.</li>
<li>ZoMG, drugs! The Forest abounds with drugs. All the bluehairs (and everyone?) take some brain-melting psychedelic (thing), which is considered wholesome and old-fashioned. It's both their sacrament wine and their cut loose on Friday wine. No big deal, old Uncle Elmer is talking to future alien trolls, just like in the good old days. Pretty much everything else is devil weed, but G&amp;G are bold, fit psychonauts and experience trips that would be considered trips from the perspective of fuddy-duddy trips. Importantly, when they meet up with the girls, there are lots of drugs and of course monkey-business (oh, that's good. let's make that just mean "fucking" and there can be a polite word for "baby-making" &#x2026;)</li>
<li>The Helpful Monkey is a river that flows towards morning-sun-right-side towards Bhorv Zolk. Its start is the confluence of an eastern branch, The Lame Rhino [tigris], and a western branch, The Great Meal Stone [Euphrates]. All together they make a Y with the bottom, virtical part pointing southwards to at Bhorv Zolk. Yes, you can look at a map of the fertile crescent. This is all just for ease-of-recall and rough geographical reckoning.</li>
<li>[nope! we have flowering plants. we <i>need</i> flowering plants.] I said "pre flowering plants", didn't I? 1) this probably impossible [maybe who cares], 2) "banana", "melon", "gourd"&#x2026;will have to rethink. All this because I wanted to use "uvula" instead of "pea"?</li>
<li>Brother -&gt; Bro is purposely propagated among the Crec. Soon cave/men/ are calling each other "bro". Then there is a great buggery scandal in "the military" during which, from one of their discussions, comes the hilarious idea of "bro-ham: a male buttocks used as a substitute for cavewomen (we need a good word for 'vag')" As in, "Out on deployment and away from your wives for moons at a time? Worry not! bro-ham abound."</li>
<li>The mysterious forest babes: G&amp;G, on one of their especially distant and daring excursions, near the border with xxx yet-anther-another-another-hated-neighboring-Forest xxx. They are sinewy, flexible, and fit. And they don't sweat much. They are giggly and have absolutely no overlapping language with G&amp;G but they somehow manage to find a way to agree to meet back at this very spot (don't forget) exactly these many moons from now (don't forget or miscalculate). And they have fun. Bouncy-bouncy. They are like a bizzaro G&amp;G, but baby-makers (although in literal terms, G&amp;G thought of babies very little). They were ingenious and mysterious like G&amp;G. They thought freely (oh so freely). And loved a bit of mischief of any kind.</li>
<li>Needs uniformity, rules, standardization:
<ul class="org-ul">
<li>Capitalization of Crecspeak</li>
<li>The language used to express numbers.</li>
<li>If we are going to "tag" Crecspeak, should be done soon.</li>
<li>I flop back and forth between "men" and "cavemen", etc. do I care? do I have a rule? am I making a point with the choices?</li>
</ul></li>
<li>It would be neat if there were lots of stories about "small-ones" (frickin babies), met at random in unimaginably distant parts of the xxxworldxxx. They don't speak. They don't act surprised. They trod on with purpose, armed like a skilled, adult hunter, look your way and nod, but never say a word and move on. These are known as forest-babies (maybe) and are fucking mystical.</li>
<li>Communication
<ul class="org-ul">
<li>Loud, long-distance whistling.</li>
<li>Somehow making a single loud bang. And then having a code "one bangith mean trouble, two bangith mean party"</li>
</ul></li>
<li>The shouting of "boulder-stump!" is something Gog did in his youth. The search for the culprit had been at least "active" until the present day.</li>
<li>Don't ever forget to make the good guys bad. There should be lots of people "signaling" who are Forest-Deer die-hards and act hella retarded. The reader should be utterly unable to decide who the good guys are.</li>
<li>There must be lots and lots of "public works" of every kind. We let the Elders-Quarum decide how to spend N% or our money and then get outraged when it's not used "correctly". Rocks, clubs, clubs with sharp sticks in them&#x2026;</li>
<li>Everyone is a caveperson. It's as appropriate to say "cavelady" as it is to say "lady".</li>
<li>The feeling is light and easy like a mockumentary. The narrator is just "me", so I don't have to remember what "voice" I'm using.</li>
<li>No humorous-fake-terms for things that <i>they</i> have and <i>we</i> have a name for. For example, no need to call a tree a "massive-weed" or to call a cat a "gerbil-dog". Or maybe yes do that. It would be pretty sweet if Crecspeak words got a special tag so we can identify, use special fonts, check for glossary leaks&#x2026;</li>
<li>Definitely have a "global warning" analog</li>
<li>Someone gets caught using the "bachelor-tree" and is vaguely shamed for it the rest of their life.</li>
<li>We need to get around to: Gog said "boulder-stump" and is tried for obscenity and has Grav as his lawyer.</li>
<li>Somewhere here and there we need to throw in a "very special" episode where someone get's gorily torn apart or beaten to death or thrown off a mountain for something that totally deserves it: man-on-man buttfucking, conning granny, child-diddling, disrespecting the Chief&#x2026; Really shock it to 'em.</li>
<li>Is there a character that's always trying to make a flying machine and fails over and over in hilarious ways. Is there?!</li>
<li>There needs to be a skill or activity that makes a caveperson really look like a badass. Like taming a hyena and riding on its back (which works out usually.) And a regulatory body that ensures that only the properly skilled are allowed to operate a hyena. Lots and lots of tests, criteria, and note scratching. They should probably have to wear some kind of coconut helmet, by law. And polished amber sunglasses: Crec-Bans.</li>
<li>The lizard-bird (always?) hunts at night because it his infra-red <i>pits</i>, like you-know-who.</li>
<li>Thag:
<ul class="org-ul">
<li>Is kind of helpless and losing control of his posse.</li>
<li>Because he needs to use so many click-clock words, he sometimes chooses "the closest thing", constrained by sounds he can't make. That plus homonyms and other zany linguistic hi-jinks, make for many a falling prat.</li>
</ul></li>
</ul>
</div>
</div>
